import time
import random

t = time.strftime("%H:%M:%S")

name = """
 _    _       _  ______     ______              _ 
| |  | |     | | |  _  \    |  ___|            | |
| |  | |_   _| |_| | | |__ _| |_ ___   ___   __| |
| |/\| | | | | __| | | / _` |  _/ _ \ / _ \ / _` |
\  /\  / |_| | |_| |/ / (_| | || (_) | (_) | (_| |
 \/  \/ \__,_|\__|___/ \__,_\_| \___/ \___/ \__,_|

                                                  """

def wutdafood():
    print(name)
    while True:
        this_time = input("ต้องการอาหารมื้อนี้ใช่หรือไม่ : ")
        # อาหารเช้า
        food_m = [["โจ๊ก", 160], ["โจ๊กหมูใส่ไข่", 250], ["ข้าว+แกงจืดหมูสับเต้าหู้ไข่", 190], ["ข้าว+ไข่พะโล้", 280],
                  ["น้ำเต้าหู้+ปลาท่องโก๋", 330], ["ข้าวเหนียว+หมูปิ้ง3ไม้", 447]]
        # อาหารกลางวัน
        food_a = [["ข้าวกะเพราหมู", 580], ["ข้าวผัดกุ้ง", 470], ["สุกี้น้ำไก่", 345], ["ลาบไก่+ข้าวเหนียว", 230],
                  ["เกาเหลา", 149], ["ผัดคะน้าหมูกรอบ", 670], ["เย็นตาโฟ", 300], ["ข้าวผัดหมู", 557], ["ข้าวไข่เจียว", 445],
                  ["สเต็กไก่", 260], ["สเต๊กปลา", 260], ["ขนมจีนน้ำยา", 350], ["ข้าวกระเพราะไก่ไข่ดาว", 630],
                  ["ราดหน้าหมี่หมูกรอบ", 690], ["ผัดไทกุ้งสดใส่ไข่", 545], ["ผัดมักกะโรนีกุ้ง", 420], ["เกาเหลาเนื้อตุ๋น", 220],
                  ["ข้าวขาหมู", 700], ["ข้าวมันไก่", 596], ["ข้าวกะเพราไก่", 478], ["กระเพาะปลา", 239], ["ขนมจีนเขียวหวานไก่", 594],
                  ["ข้าวไข่เจียวหมูสับ", 500], ["ข้าวหมูกกระเทียม", 550], ["ข้าวผัดอเมริกัน", 800]]
        # อาหารเย็น
        food_e = [["ส้มตำปู", 35], ["น้ำพริกผักต้ม", 70], ["ส้มตำข้าวโพด", 90], ["ต้มเลือดหมู", 120], ["ไข่ตุ๋น", 75],
                  ["ปลานึ่งมะนาว", 155], ["ปลาเผา", 155], ["ข้าวต้มทรงเครื่อง", 230], ["เกี๊ยวน้ำ", 275], ["ข้าว+แกงส้ม", 270]]
        # อาหารว่าง
        food_b = [["น้ำเปล่า", 0], ["แมว", 0]]
        # รวม
        food_all = food_b + food_e + food_m + food_a

        if this_time == "ไม่":
            ran = random.randint(0, len(food_all)-1)
            return "อาหารที่แนะนำ " + food_all[ran][0] + " พลังงานที่คาดว่าได้รับ " + str(food_all[ran][1]) + " กิโลแคลลอรี"

        elif this_time == "ใช่":
            if t[:2] == "07" or t[:2] == "08":
                ran = random.randint(0, len(food_m)-1)
                return "อาหารมื้อเช้า '" + food_m[ran][0] + "' พลังงานที่คาดว่าได้รับ " + str(food_m[ran][1]) + " กิโลแคลลอรี"
            elif t[:2] == "11" or t[:2] == "12" or t[:2] == "13":
                ran = random.randint(0, len(food_a)-1)
                return "อาหารมื้อกลางวัน '" + food_a[ran][0] + "' พลังงานที่คาดว่าได้รับ " + str(food_a[ran][1]) + " กิโลแคลลอรี"
            elif t[:2] == "17" or t[:2] == "18":
                ran = random.randint(0, len(food_e)-1)
                return "อาหารมื้อเย็น '" + food_e[ran][0] + "' พลังงานที่คาดว่าได้รับ " + str(food_e[ran][1]) + " กิโลแคลลอรี"
            else:
                ran = random.randint(0, len(food_b)-1)
                return "เวลานี้ไม่ควรทานอาหาร แต่ถ้าหิวก็อาจทาน '" + food_b[ran][0] + "' พลังงานที่คาดว่าได้รับ " + str(food_b[ran][1]) + " กิโลแคลลอรี"
        else:
            print("กรุณากรอก ใช่ หรือกรอก ไม่")

print(wutdafood())
